benchmarks/results/20260729-load-health-autocannon.txt
npm warn Unknown env config "devdir". This will stop working in the next major version of npm. See `npm help npmrc` for supported config options.

> medbot@0.1.0 load:health
> tsx -r dotenv/config benchmarks/run-health-load.ts


========== HEALTH LOAD (autocannon) ==========

{
  url: 'http://127.0.0.1:3000/api/health',
  durationSec: 15,
  connections: 25
}
Running 15s test @ http://127.0.0.1:3000/api/health
25 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬──────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼──────────┼────────┤
│ Latency │ 112 ms │ 127 ms │ 145 ms │ 151 ms │ 130.36 ms │ 35.35 ms │ 552 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 111     │ 111     │ 195     │ 202     │ 190.34  │ 21.35   │ 111     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 40.8 kB │ 40.8 kB │ 71.6 kB │ 74.2 kB │ 69.9 kB │ 7.83 kB │ 40.7 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 15

3k requests in 15.02s, 1.05 MB read

--- Results ---
┌──────────────────┬────────┐
│ (index)          │ Values │
├──────────────────┼────────┤
│ requests         │ 2855   │
│ throughputReqSec │ 190    │
│ latencyMeanMs    │ 130    │
│ latencyP50Ms     │ 127    │
│ latencyP95Ms     │ 145    │
│ latencyP99Ms     │ 151    │
│ errors           │ 0      │
│ timeouts         │ 0      │
│ non2xx           │ 0      │
└──────────────────┴────────┘